Various fixes, delete old files
